#### Friction Property

---

|  |
| --- |
| MEPSection Class   See Also |

The friction of the section.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double Friction { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Friction As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double Friction { 	double get (); } ``` |

# Remarks

In one section, all section members have same friction. Default unit is Feet of Water (60 Â°F) per 100 feet. For Duct, unit type is UT\_HVAC\_Friction. For Pipe, unit type is UT\_Piping\_Friction

# See Also

MEPSection Class

Autodesk.Revit.DB.Mechanical Namespace